<template>
    <div class="privacy-content__wrapper">
        <div class="container">
            <div class="privacy-content">
                <div class="privacy-content__title">
                    ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ
                </div>

                <div class="privacy-content__text" v-if="restaurant" v-html="parsedPrivacy">
                </div>


                <!-- <div class="privacy-content__text">
                    Настоящая Политика конфиденциальности (далее-Политика) устанавливает правила использования персональных данных, получаемых от Пользователей сайта (далее-Пользователь) и администратором сайта <a class="privacy-content__link" href="https://ravedelivery.com/">https://ravedelivery.com/</a> принадлежащий Обществу с ограниченной ответственностью «ВИКТОРИЯ 2803», ИНН 9303037775, ОГРНИП1249300011806, место нахождения: 283001, ДНР, г.о. Донецк, г. Донецк, бульвар Пушкина, дом 25 (далее-Оператор).
                    <br>Политика применяется ко всем Пользователям сайта. Все термины и определения, встречающиеся в тексте Политики толкуются в соответствии с действующим законодательством РФ (в частности, Федеральный закон от 27.07.2006 г. №152-ФЗ «О персональных данных»)
                    <br>Пользователи прямо соглашаются на обработку своих персональных данных, как это описано в настоящей Политике. Использование сайта означает выражение Пользователем безоговорочного согласия с Политикой и указанными условиями обработки информации.
                    <br>Пользователь не должен пользоваться сайтом, если Пользователь не согласен с условиями Политики.
                </div>
                
                <div class="privacy-content__title">
                    1. ПЕРСОНАЛЬНЫЕ ДАННЫЕ ПОЛЬЗОВАТЕЛЕЙ, КОТОРЫЕ ОБРАБАТЫВАЕТ ОПЕРАТОР
                </div>
                <div class="privacy-content__text">
                    1.1. Сайт собирает, получает и использует в определенных Политикой целях персональные данные Пользователей.
                    <br>1.2. Под персональными данными Пользователя понимается информация, которую пользователь предоставляет Оператору при заполнении заявки или формы обратной связи на Сайте и последующим использованием Сайта.
                    <br>1.3. Оператор также может обрабатывать данные, сделанные общедоступными субъектом персональных данных или подлежащие опубликованию, или обязательному раскрытию в соответствии с законодательством РФ.
                    <br>1.4. Оператор не проверяет достоверность персональных данных, предоставляемых Пользователем, и не имеет возможности оценивать его дееспособность. Однако Оператор исходит из того, что Пользователь предоставляет достоверную и достаточную персональную информацию о себе и поддерживает данную информацию в актуальном виде.
                    <br>Под персональными данными подразумевается любая информация личного характера, позволяющая установить личность Пользователя, такая как:
                    <br>- имя Пользователя;
                    <br>- контактный телефон Пользователя (а также указанный Пользователем 
                    <br>контактный телефон получателя заказа);
                    <br>- адрес Пользователя, по которому осуществляется доставка заказа;
                </div>

                <div class="privacy-content__title">
                    2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ
                </div>
                <div class="privacy-content__text">
                    2.1. Главная цель Оператора при сборе персональных данных:
                    <br>- установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта, оказания услуг;
                    <br>- обработку запросов и заявок от Пользователя, предоставления Пользователю эффективной клиентской и технической поддержки.
                </div>
                
                <div class="privacy-content__title">
                    3. УСЛОВИЯ И СПОСОБЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ, И ЕЕ ПЕРЕДАЧА ТРЕТЬИМ ЛИЦАМ
                </div>
                <div class="privacy-content__text">
                    3.1. Пользователь дает согласие на обработку своих персональных данных путем отправки заявки (любой письменный или электронный запрос, содержащий контактные данные).
                    <br>3.2. Обработка персональных данных Пользователя означает сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу, блокирование, удаление, уничтожение персональных данных Пользователя.
                    <br>3.3. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления Пользователем информации о себе для общего доступа неограниченному кругу лиц.
                    <br>3.4 Оператор вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:
                    <br>- Пользователь выразил согласие на такие действия;
                    <br>- передача необходима для исполнения определенного договора или соглашения с Пользователем, или для использования определенной услуги Сайта;
                    <br>- передача уполномоченным органам государственной власти Российской Федерации по основаниям и в порядке, установленным законодательством Российской Федерации.
                    <br>- в целях обеспечения возможности защиты прав и законных интересов Оператора или третьих лиц в случаях, когда Пользователь нарушает условия договоров и соглашений с Оператором, настоящую Политику;
                    <br>- в результате обработки персональной информации Пользователя путем ее обезличивания получены обезличенные статистические данные, которые передаются третьему лицу для проведения исследований, оказания услуг или выполнения работ.
                </div>
                
                <div class="privacy-content__title">
                    4. МЕРЫ, ПРИМЕНЯЕМЫЕ ДЛЯ ЗАЩИТЫ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ
                </div>
                <div class="privacy-content__text">
                    4.1. Оператор принимает необходимые и достаточные правовые, организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.
                    <br>4.2.Хранение персональных данных Пользователей может осуществляться не дольше, чем этого требуют цели обработки, если иное не предусмотрено законодательством РФ.
                </div>
                
                <div class="privacy-content__title">
                    5. РАЗРЕШЕНИЕ СПОРОВ
                </div>
                <div class="privacy-content__text">
                    5.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта <a class="privacy-content__link" href="https://ravedelivery.com/">https://ravedelivery.com/</a> и Оператором, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).
                </div>
                
                <div class="privacy-content__title">
                    6. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
                </div>
                <div class="privacy-content__text">
                    6.1.Оператор вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.
                    <br>6.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики конфиденциальности.
                    <br>6.3. Продолжение использования Сайта после внесения таких изменений подтверждает согласие Пользователя с такими изменениями.
                    <br>6.4. Все предложения, вопросы, запросы и иные обращения по поводу настоящей Политики и использования своих персональных данных Пользователь вправе направлять Сайту:
                    <br>6.4.1. по адресу электронной почты: rave.group@yandex.ru
                    <br>6.4.2. по почтовому адресу: 283001, ДНР, г.о. Донецк, г. Донецк, бульвар Пушкина, дом 25
                </div> -->
            </div>
        </div>
    </div>
</template>

<script>
import { mapState } from 'vuex';
import { marked } from 'marked';

export default {
    name: 'PrivacyContent',
    props: {
        restaurantSlug: String
    },
    computed: {
        ...mapState('restaurant', ['restaurants']),
        restaurant() {
            return this.restaurants.find(r => r.slug === this.restaurantSlug);
        },
        parsedPrivacy() {
            return this.restaurant ? marked(this.restaurant.privacy) : '';
        }
    }
}
</script>

<style scoped>
    .privacy-content__wrapper .container{
        max-width: 1144px;
    }

    .privacy-content__title{
        font-family: Vela Sans GX;
        font-weight: 500;
        font-size: 16px;
        line-height: 145%;
        letter-spacing: -5%;

        color: #000000;
    }

    .privacy-content__text{
        margin: 24px 0;
        font-family: Vela Sans GX;
        font-weight: 400;
        font-size: 16px;
        line-height: 145%;
        letter-spacing: -5%;

        color: #505050;
    }

    .privacy-content__link{
        text-decoration: underline;
        color: #505050;
    }

    .privacy-content__text :deep(ol) {
        margin: 1em 0;
        font-family: Vela Sans GX;
        font-weight: 500;
        font-size: 16px;
        line-height: 145%;
        letter-spacing: -5%;

        color: #000000;
    }

    .privacy-content__text :deep(li) {
        font-family: Vela Sans GX;
        font-weight: 500;
        font-size: 16px;
        line-height: 145%;
        letter-spacing: -5%;

        color: #000000;
    }

    .privacy-content__text :deep(p) {
        font-family: Vela Sans GX;
        font-weight: 400;
        font-size: 16px;
        line-height: 145%;
        letter-spacing: -5%;

        color: #505050;
    }

    .privacy-content__text :deep(strong) {
        font-weight: 500;
    }

    .privacy-content__text :deep(a) {
        color: #505050;
        text-decoration: underline;
    }
</style>